export default{
    data(){
        return {
            /*newsList: [
                {
                   title: '我是新闻列表我是新闻列表',
                   content: '习近平在慰问电中表示，惊悉贵国克麦罗沃市发生火灾，造成重大人员伤亡和财产损失。我谨代表中国政府和中国人民，并以我个人的名义，对所有遇难者表示沉痛的哀悼，向受伤者和遇难者家属致以深切的同情和诚挚的慰问。',
                   user: '卡勒季',
                   time: '2018-04-03',
                   src: 'http://pic3.16pic.com/00/04/92/16pic_492293_b.jpg'
                },
                {
                    title: '2017甘肃平凉市人命政府办公室选调报告2017甘肃平凉市人命政府办公室选调报告',
                    content: '习近平在慰问电中表示，惊悉贵国克麦罗沃市发生火灾，造成重大人员伤亡和财产损失。我谨代表中国政府和中国人民，并以我个人的名义，对所有遇难者表示沉痛的哀悼，向受伤者和遇难者家属致以深切的同情和诚挚的慰问。',
                    user: '卡勒季',
                    time: '2018-04-04'
                 },
                 {
                    title: '我是新闻列表我是新闻列表',
                    content: '习近平在慰问电中表示，惊悉贵国克麦罗沃市发生火灾，造成重大人员伤亡和财产损失。我谨代表中国政府和中国人民，并以我个人的名义，对所有遇难者表示沉痛的哀悼，向受伤者和遇难者家属致以深切的同情和诚挚的慰问。',
                    user: '卡勒季',
                    time: '2018-04-05',
                    src: 'http://pic1.16pic.com/00/26/30/16pic_2630859_b.jpg'
                 },
                 {
                    title: '我是新闻列表我是新闻列表',
                    content: '习近平在慰问电中表示，惊悉贵国克麦罗沃市发生火灾，造成重大人员伤亡和财产损失。我谨代表中国政府和中国人民，并以我个人的名义，对所有遇难者表示沉痛的哀悼，向受伤者和遇难者家属致以深切的同情和诚挚的慰问。',
                    user: '卡勒季',
                    time: '2018-04-06'
                 },
                 {
                    title: '2017甘肃平凉市人命政府办公室选调报告',
                    content: '习近平在慰问电中表示，惊悉贵国克麦罗沃市发生火灾，造成重大人员伤亡和财产损失。我谨代表中国政府和中国人民，并以我个人的名义，对所有遇难者表示沉痛的哀悼，向受伤者和遇难者家属致以深切的同情和诚挚的慰问。',
                    user: '卡勒季',
                    time: '2018-04-07'
                 },
                 {
                    title: '我是新闻列表我是新闻列表',
                    content: '习近平在慰问电中表示，惊悉贵国克麦罗沃市发生火灾，造成重大人员伤亡和财产损失。我谨代表中国政府和中国人民，并以我个人的名义，对所有遇难者表示沉痛的哀悼，向受伤者和遇难者家属致以深切的同情和诚挚的慰问。',
                    user: '卡勒季',
                    time: '2018-04-08'
                 }
            ]*/
            newsList: []
        }
    },
    methods: {
        details(item){
            this.$router.push({
                name: 'Details',
                params: item
            })
        },
        //获取新闻列表
        getNewsList() {
            this.$post('news/queryNews',{
                drtype: '新闻'
            }).then(res=>{
                if(res.code == 0){
                    this.newsList = res.data
                }
                console.log(res)
                console.log(res.data)
            },err=>{
                this.$toast('网络异常！')
            })
        }
    },
    mounted(){
        this.getNewsList()
    }
}